Autodesk.Revit.DB.CurveOverlapPointType
An enumeration characterizing a point shared by two curves.
Since:
2026
Since:
2026

Autodesk.Revit.DB.CurveOverlapPointType.IntervalEnd
The point marks the end of an interval over which the two curves overlap.

Autodesk.Revit.DB.CurveOverlapPointType.IntervalStart
The point marks the beginning of an interval over which the two curves overlap.

Autodesk.Revit.DB.CurveOverlapPointType.Intersection
The point marks a transverse intersection of the two curves.

Autodesk.Revit.DB.CurveOverlapPointType.Uninitialized
The value is uninitialized.